{
    "title": "Live Stream Notifier",
    "summary": "Never miss the stream of your favorite creator again with this extension. You will get notifications for updates and get quick access to them from the toolbar. Works with most major streaming services, including Twitch, YouTube and Mixer.",
    "description": "Catching a stream is hard, unless you have the channel page constantly open or live on Twitter. Live Stream Notifier checks the status of your favorite streamers in the background while you do other things and shows you a notification when they go live.\n\n<ul>\n <li>Sometimes you miss a notification, which is why you can access all streams ordered by status from a handy button in the toolbar.</li>\n<li>You can also know when the title changes, the stream goes offline or the broadcaster starts to redirect (host) to another stream or replays an older broadcast.</li>\n<li>The popup from the toolbar button also offers an explore tab, where you can find popular streams from multiple platforms.</li>\n</ul>\nThere are many power-user oriented features:\n<ul>\n<li>Filter the list of channels in the panel, because you follow every streamer in the world.</li>\n<li>A context menu on channels, that lets you jump to their chat or copy their URL with a custom pattern around it (defaults to just the URL).</li>\n<li>A channel manager that lets you easily add channels a user follows or mass-remove hundreds of channels at once.</li>\n<li>All notification types are individually disableable.</li>\n</ul>\nIf the extension is running in an environment where Firefox supports parental controls it will hide mature content when possible.\n\n<b>Feedback and help</b>\nFull usage guides and a brief FAQ can be found in the <a href=\"http://streamnotifier.ch/help\">Help section of the extension website</a>.\n\nFor feedback and support by a human, there is a <a href=\"https://discourse.mozilla-community.org/t/support-live-stream-notifier/6762\">Mozilla Discourse thread</a> or you can use one of the communication methods listed in the <a href=\"http://streamnotifier.ch/help\">Contact section of the extension website</a>. Feel free to contact me for feature suggestions, to ask about configuration tips, report issues or get trouble-shooting help.\n\n<b>Supported streaming platforms</b>\n<ul>\n<li>Dailymotion</li>\n<li>DouyuTV</li>\n<li>livestream (new and old site)</li>\n<li>MLG.tv</li>\n<li>Mixer</li>\n<li>Picarto.tv</li>\n<li>Smashcast</li>\n<li>Twitch</li>\n<li>Ustream</li>\n<li>YouTube</li>\n</ul>\n\n<em>Find a more detailed list on <a href=\"http://streamnotifier.ch/providers/\">streamnotifier.ch/providers</a></em>\n\n<b>Translations</b>\nThis extension is available in English and German with partial support for French and some other languages. To help with translating the extension, check out the \"Developer Comments\" section below the reviews.\n\n<b>Firefox 57 Support</b>\nThis extension will be supported for future versions of Firefox, including 57 and beyond. Some features (namely parental controls and auto detection of provider users) may no longer work in the short term.\n\n<b>Misc</b>\nCheck out the development channel at the bottom of the page for in-development versions with experimental features.\nIf you want sounds for you notifications and Firefox doesn't make a sound by default, you can use the <a href=\"https://addons.mozilla.org/en-US/firefox/addon/notification-sound/?src=external-jtvnlisting\">Notification Sound extension</a> to get a sound whenever a notification is displayed.",
    "technicalDetails": "<ul>\n<li><b>Bugs</b>\nIf you run into a bug, please either post in the <a href=\"https://discourse.mozilla-community.org/t/support-live-stream-notifier/6762\">discourse thread</a>, send me an e-Mail to the support e-Mail or file an issue on <a href=\"https://github.com/freaktechnik/justintv-stream-notifications/issues\">GitHub</a>.</li>\n<li>\n<b>Feature Suggestion</b>\nSame as for Bugs.\n</li><li>\n<b>Localization</b>\nTo translate register on Transifex and add your translation to this project: https://www.transifex.com/freaktechnik/live-stream-notifier . See the <a href=\"https://github.com/freaktechnik/justintv-stream-notifications/blob/master/.github/CONTRIBUTING.md#translations\">CONTRIBUTING.md</a> for more detailed instructions."
}
